{"index.html":"<html><head><script src=\"https://cdn.syncfusion.com/ej2/22.1.34/dist/ej2.min.js\" type=\"text/javascript\"></script>\n    <link href=\"https://cdn.syncfusion.com/ej2/22.1.34/material.css\" rel=\"stylesheet\">\n\n    <link href=\"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\" rel=\"stylesheet\">\n\n    <style>\n            body{\n                touch-action:none;\n            }\n            .control-section{\n                margin-top:100px;\n            }\n        </style></head><body><div class=\"stackblitz-container {{theme}}\"><div class=\"control-section\">\n    <div class=\"sample-container\">\n        <div class=\"default-section\">\n            <div id=\"quickRTE\">\n                <p>Solar energy is radiant light and heat from the sun that is harnessed and converted into usable forms of energy. It\n                    is a clean, renewable, and abundant source of power that has a wide range of applications across various sectors.\n                    Solar energy is typically harnessed through solar technologies, such as photovoltaic (PV) cells and solar thermal\n                    systems.</p>\n                <p>Here's an overview of solar energy:</p>\n                <h3><strong>Photovoltaic (PV) solar energy:</strong></h3>\n                <p>Photovoltaic Cells: PV cells, commonly known as solar cells, convert sunlight directly into electricity. They are\n                    made of semiconductor materials, often silicon, which absorb photons (particles of light) and release electrons,\n                    generating an electric current.</p>\n                <p>Applications: PV solar energy is used for residential and commercial electricity generation, remote power systems,\n                    and grid-connected utility-scale power plants.</p>\n                <h3><strong>Solar Thermal Energy:</strong></h3>\n                <ul>\n                    <li>Concentrated Solar Power (CSP): CSP systems use mirrors or lenses to concentrate sunlight\n                        onto a receiver. The collected heat is used to generate steam, which drives turbines and generates electricity.\n                    </li>\n                    <li>Solar Water Heating: Solar thermal systems can heat water for domestic or industrial use. They consist of solar\n                        collectors that absorb sunlight and transfer heat to a fluid, which is then used for heating.</li>\n                </ul>\n                <h3><strong>Solar Energy Advantages:</strong></h3>\n                <p>Renewable and Abundant: Solar energy is virtually limitless, as the sun provides an immense and continuous supply of\n                    energy.\n                    Clean and Environmentally Friendly: Solar energy production does not emit greenhouse gases or other pollutants,\n                    contributing to a reduced carbon footprint and improved air quality.\n                    Reduced Energy Bills: Solar installations can significantly lower electricity bills for homes and businesses by\n                    generating free electricity from the sun.\n                    Low Operating and Maintenance Costs: Solar systems have minimal operating and maintenance costs once installed,\n                    making them cost-effective over their lifespan.</p>\n                <h3><strong>Challenges and Considerations:</strong></h3>\n                <p>Intermittency: Solar energy is dependent on sunlight, which varies with weather conditions and the time of day.\n                    Energy\n                    storage solutions are important to ensure a continuous power supply.\n                    Initial Costs: While solar energy has become more affordable, the upfront costs of solar panel installation can be a\n                    barrier for some.\n                    Space Requirements: Large solar installations require substantial land or roof space to achieve significant energy\n                    output.\n                    Efficiency and Technology: Solar panel efficiency continues to improve, but optimising energy conversion and storage\n                    technologies remains a focus.</p>\n                <h3><strong>Solar Energy Applications:</strong></h3>\n                <p>Residential Energy: Homeowners can install solar panels on rooftops to generate electricity for personal use or even\n                    sell excess power back to the grid.\n                    Commercial and Industrial: Businesses and industries use solar energy to power their operations, reduce energy\n                    costs, and meet sustainability goals.\n                    Off-Grid Power: Solar power is invaluable in remote areas without access to traditional power grids, providing\n                    electricity for lighting, communication, and basic needs.\n                    Solar-Powered Transportation: Solar energy can be used to charge electric vehicles (EVs) and provide energy for\n                    electric public transportation.</p>\n                <p><img src=\"https://media.istockphoto.com/id/494417257/photo/photovoltaic-panels.jpg?s=612x612&amp;w=0&amp;k=20&amp;c=USdqOh0Pjuyv-jOB-ny5JPV6VQ1U5PvPo-xgBuhKPxc=\" width=\"300px\" class=\"e-rte-image e-imginline\">\n                </p>     \n            </div>\n        </div>\n    </div>\n</div>\n\n\n</div></body></html>","index.js":"{{ripple}}/*jshint esversion: 6 */\n/**\n * Rich Text Editor text quick toolbar sample\n */\n\n    var defaultRTE = new ej.richtexteditor.RichTextEditor({\n        quickToolbarSettings: {\n            text: ['FormatPainter', 'Bold', 'Italic', 'Underline', 'Formats', '-', 'Alignments', 'OrderedList', 'UnorderedList', 'CreateLink', 'Image']\n        },\n        toolbarSettings: {\n            type: 'MultiRow',\n            enableFloating: false,\n        },\n    });\n    defaultRTE.appendTo(\"#quickRTE\");\n\n    "}