{"index.html":"<html><head><script src=\"https://cdn.syncfusion.com/ej2/28.1.33/dist/ej2.min.js\" type=\"text/javascript\"></script>\n    <link href=\"https://cdn.syncfusion.com/ej2/28.1.33/{{theme}}.css\" rel=\"stylesheet\">\n\n    <link href=\"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\" rel=\"stylesheet\">\n\n    <style>\n            body{\n                touch-action:none;\n            }\n            .control-section{\n                margin-top:100px;\n            }\n        </style></head><body><div class=\"stackblitz-container {{theme}}\"><div class=\"col-lg-12 control-section\">\n    <div class=\"e-sample-resize-container\">\n        <div id=\"tab_rtl\">\n        </div>\n    </div>\n</div>\n\n\n<style>\n    .e-content .e-item {\n        font-size: 12px;\n        padding: 10px;\n        text-align: justify;\n    }\n    .container {\n        min-width: 350px;\n        max-width: 500px;\n        margin: 0 auto;\n    }\n</style></div></body></html>","index.js":"{{ripple}}/**\n *  Tab rtl sample\n */\n\n    //Initialize Tab component\n     var tabObj = new ej.navigations.Tab({\n          enableRtl: true,\n           items: [\n            {\n                header: { 'text': 'Twitter' },\n                content: 'Twitter is an online social networking service that enables users to send and read short 140-character ' +\n                'messages called \"tweets\". Registered users can read and post tweets, but those who are unregistered can only read ' +\n                'them. Users access Twitter through the website interface, SMS or mobile device app Twitter Inc. is based in San ' +\n                'Francisco and has more than 25 offices around the world. Twitter was created in March 2006 by Jack Dorsey, ' +\n                'Evan Williams, Biz Stone, and Noah Glass and launched in July 2006. The service rapidly gained worldwide popularity, ' +\n                'with more than 100 million users posting 340 million tweets a day in 2012. The service also handled 1.6 billion ' +\n                'search queries per day.'\n            },\n            {\n                header: { 'text': 'Facebook' },\n                content: 'Facebook is an online social networking service headquartered in Menlo Park, California. Its website was ' +\n                'launched on February 4, 2004, by Mark Zuckerberg with his Harvard College roommates and fellow students Eduardo ' +\n                'Saverin, Andrew McCollum, Dustin Moskovitz and Chris Hughes. The founders had initially limited the website\\'\\s ' +\n                'membership to Harvard students, but later expanded it to colleges in the Boston area, the Ivy League, and Stanford ' +\n                'University. It gradually added support for students at various other universities and later to high-school students.'\n            },\n            {\n                header: { 'text': 'WhatsApp' },\n                content: 'WhatsApp Messenger is a proprietary cross-platform instant messaging client for smartphones that operates ' +\n                'under a subscription business model. It uses the Internet to send text messages, images, video, user location and ' +\n                'audio media messages to other users using standard cellular mobile numbers. As of February 2016, WhatsApp had a user ' +\n                'base of up to one billion, making it the most globally popular messaging application. WhatsApp Inc., based in ' +\n                'Mountain View, California, was acquired by Facebook Inc. on February 19, 2014, for approximately US$19.3 billion.'\n            }\n        ]\n    });\n    //Render initialized Tab component\n    tabObj.appendTo('#tab_rtl');\n"}